Revit 2027 API
FilterStringGreaterOrEqual Class
 Tests whether string values from the document would sort after or match a certain string.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterStringRuleEvaluator
 Autodesk.Revit.DB.FilterStringGreaterOrEqual
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilterStringGreaterOrEqual : FilterStringRuleEvaluator
Public Class FilterStringGreaterOrEqual
	Inherits FilterStringRuleEvaluator
public ref class FilterStringGreaterOrEqual : public FilterStringRuleEvaluator
type FilterStringGreaterOrEqual =
    class
        inherit FilterStringRuleEvaluator
    end
The FilterStringGreaterOrEqual type exposes the following members.
Constructors
Name | Description
FilterStringGreaterOrEqual |  Constructs an instance of FilterStringGreaterOrEqual.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from FilterStringRuleEvaluator)
Top
Methods
Name | Description
Dispose
(Inherited from FilterStringRuleEvaluator)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
Evaluate |  Derived classes override this method to implement the test that determines whether the two given string values satisfy the desired condition or not.
(Inherited from FilterStringRuleEvaluator)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 All string comparisons in this class are performed in the case-insensitive manner.
See Also
Reference
Autodesk.Revit.DB Namespace